<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
	<body>
<h2 style="margin-top: 12px;"><span style="color: #0070c0;">16. C&aacute;ch d&ugrave;ng should trong một số trường hợp cụ thể kh&aacute;c</span></h2>
<ul>
    <li>
    <p style="margin-top: 12px;">Diễn đạt kết quả của một yếu tố tưởng tượng: Sẽ<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; If I was asked to work on Sunday I&nbsp;<span style="text-decoration: underline;">should</span>&nbsp;resign.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng trong mệnh đề c&oacute;&nbsp;<em>that</em>&nbsp;sau những t&iacute;nh từ chỉ trạng th&aacute;i như&nbsp;<em>anxious/ sorry/ concerned/ happy/ delighted</em>...: Lấy l&agrave;m ... rằng/ lấy l&agrave;m ...v&igrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I'm anxious that she should be well cared for.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (T&ocirc;i lo lắng rằng liệu c&ocirc; ấy c&oacute; được săn s&oacute;c tốt kh&ocirc;ng)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We are sorry that you should feel uncomfortable&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (Ch&uacute;ng t&ocirc;i lấy l&agrave;m tiếc v&igrave; anh thấy kh&ocirc;ng được thoải m&aacute;i)&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; That you should speak to him like that is quite astonishing&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (C&aacute;i c&aacute;ch m&agrave; anh n&oacute;i với anh ấy như vậy quả l&agrave; đ&aacute;ng ngạc nhi&ecirc;n).</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng với&nbsp;<strong>if/in case</strong>&nbsp;để chỉ một điều kh&oacute; c&oacute; thể xảy ra, người ta đưa ra &yacute; kiến chỉ đề ph&ograve;ng ngừa.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; If you should change your mind, please let me know.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In case he should have forgotten to go to the airport, nobody will be there to meet her.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (Ngộ nhỡ &ocirc;ng ấy qu&ecirc;n ra s&acirc;n bay, th&igrave; sẽ kh&ocirc;ng c&oacute; ai ở đ&oacute; đ&oacute;n c&ocirc; ta mất)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng sau so that/ in order that để chỉ mục đ&iacute;ch (Thay cho would/ could)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He put the cases in the car so that he should be able to make an early start.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She repeated the instructions slowly in order that he should understand.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng trong lời y&ecirc;u cầu lịch sự<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I should like to make a phone call, if possible.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (t&ocirc;i xin ph&eacute;p gọi điện thoại nếu t&ocirc;i c&oacute; thể)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng với imagine/ say/ think... để đưa ra lời đề nghị: Thiết tưởng, cho l&agrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I should imagine it will take about 3 hours&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (T&ocirc;i thiết tưởng c&ocirc;ng việc sẽ tốn mất 3 giờ đồng hồ đấy).<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I should say she's over 40&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (T&ocirc;i cho l&agrave; b&agrave; ta đ&atilde; ngo&agrave;i 40)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng trong c&acirc;u hỏi để diễn tả sự nghi ngờ, thiếu chắc chắn<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; How should I know? (L&agrave;m sao t&ocirc;i biết được kia chứ)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Why should he thinks that? (sao n&oacute; lại nghĩ như vậy chứ)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">D&ugrave;ng với c&aacute;c đại từ nghi vấn như&nbsp;<em>what/ where/ who</em>&nbsp;để diễn tả sự ngạc nhi&ecirc;n, thường d&ugrave;ng với "But".<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I was thinking of going to see John when who should appear but John himself.&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (T&ocirc;i đang t&iacute;nh l&agrave; đến thăm John th&igrave; người xuất hiện lại ch&iacute;nh l&agrave; anh ấy)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; What should I find but an enormous spider&nbsp;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (C&aacute;i m&agrave; t&ocirc;i nh&igrave;n thấy lại ch&iacute;nh l&agrave; một con nhện khổng lồ)</p>
    </li>
</ul>

	</body>
</html>