<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
	<body>
<h2><span style="color: #4f81bd;"><a name="2">2</a>. Noun phrase (ngữ danh từ)</span></h2>
<h3><span style="color: #0070c0;"><a name="2.1">2.1</a>&nbsp;Danh từ đếm được v&agrave; kh&ocirc;ng đếm được (Count noun/ Non-count noun):</span></h3>
<p>&middot;&nbsp;<strong>Danh từ đếm được</strong>: L&agrave; danh từ c&oacute; thể d&ugrave;ng được với số đếm, do đ&oacute; n&oacute; c&oacute; 2 h&igrave;nh th&aacute;i số &iacute;t v&agrave; số nhiều. N&oacute; d&ugrave;ng được với&nbsp;<em>a</em>&nbsp;hay với&nbsp;<em>the</em>. VD: one book, two books, ...&nbsp;<br />
<br />
&middot;&nbsp;<strong>Danh từ kh&ocirc;ng đếm được</strong>: Kh&ocirc;ng d&ugrave;ng được với số đếm, do đ&oacute; n&oacute; kh&ocirc;ng c&oacute; h&igrave;nh th&aacute;i số &iacute;t, số nhiều. N&oacute; kh&ocirc;ng thể d&ugrave;ng được với&nbsp;<em>a</em>, c&ograve;n&nbsp;<em>the</em>&nbsp;chỉ trong một số trường hợp đặc biệt. VD: milk (sữa). Bạn kh&ocirc;ng thể n&oacute;i "one milk", "two milks" ... (Một số vật chất kh&ocirc;ng đếm được c&oacute; thể được chứa trong c&aacute;c b&igrave;nh đựng, bao b&igrave;... đếm được. VD: one glass of milk - một cốc sữa).&nbsp;<br />
<br />
&middot; Một số danh từ đếm được c&oacute; h&igrave;nh th&aacute;i số nhiều đặc biệt. VD: person - people; child - children; tooth &ndash; teeth; foot &ndash; feet; mouse &ndash; mice ...&nbsp;<br />
<br />
&middot; Một số danh từ đếm được c&oacute; dạng số &iacute;t/ số nhiều như nhau chỉ ph&acirc;n biệt bằng c&oacute; "a" v&agrave; kh&ocirc;ng c&oacute; "a":&nbsp;<br />
an aircraft/ aircraft; a sheep/ sheep; a fish/ fish.&nbsp;<br />
<br />
&middot; Một số c&aacute;c danh từ kh&ocirc;ng đếm được như food, meat, money, sand, water ... đ&ocirc;i khi được d&ugrave;ng như c&aacute;c danh từ số nhiều để chỉ c&aacute;c dạng, loại kh&aacute;c nhau của vật liệu đ&oacute;.&nbsp;<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is&nbsp;<span style="text-decoration: underline;">one of the foods</span>&nbsp;that my doctor wants me to eat.&nbsp;<br />
<br />
&middot; Danh từ "time" nếu d&ugrave;ng với nghĩa l&agrave; "thời gian" l&agrave; kh&ocirc;ng đếm được nhưng khi d&ugrave;ng với nghĩa l&agrave; "thời đại" hay "số lần" l&agrave; danh từ đếm được.&nbsp;<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; You have spent too much&nbsp;<span style="text-decoration: underline;">time</span>&nbsp;on that homework. (thời gian, kh&ocirc;ng đếm được)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have seen that movie three&nbsp;<span style="text-decoration: underline;">times</span>&nbsp;before. (số lần, đếm được)</p>
<p><strong>Bảng sau l&agrave; c&aacute;c định ngữ d&ugrave;ng được với c&aacute;c danh từ đếm được v&agrave; kh&ocirc;ng đếm được.</strong></p>
<table border="1" width="100%">
    <tbody>
        <tr>
            <td style="width: 319px;">WITH COUNT NOUN&nbsp;</td>
            <td style="width: 319px;">WITH NON-COUNT NOUN</td>
        </tr>
        <tr>
            <td style="width: 319px;">a(n), the, some, any&nbsp;</td>
            <td style="width: 319px;">the, some, any&nbsp;</td>
        </tr>
        <tr>
            <td style="width: 319px;">this, that, these, those&nbsp;</td>
            <td style="width: 319px;">this, that&nbsp;</td>
        </tr>
        <tr>
            <td style="width: 319px;">none, one, two, three,...&nbsp;</td>
            <td style="width: 319px;">None&nbsp;</td>
        </tr>
        <tr>
            <td style="width: 319px;">many&nbsp;<br />
            a lot of&nbsp;<br />
            a [large / great]&nbsp;<span style="text-decoration: underline;">number of</span>&nbsp;<br />
            (a) few&nbsp;<br />
            <span style="text-decoration: underline;">fewer</span>... than&nbsp;<br />
            more....than</td>
            <td style="width: 319px;">much (thường d&ugrave;ng trong c&acirc;u phủ định, c&acirc;u hỏi)&nbsp;<br />
            a lot of&nbsp;<br />
            a large&nbsp;<span style="text-decoration: underline;">amount of</span><br />
            (a) little&nbsp;<br />
            <span style="text-decoration: underline;">less</span>....than&nbsp;<br />
            more....than</td>
        </tr>
    </tbody>
</table>
<p><strong>Một số từ kh&ocirc;ng đếm được n&ecirc;n biết:</strong></p>
<table border="0" width="100%">
    <tbody>
        <tr>
            <td style="width: 157px;">sand<br />
            food<br />
            meat<br />
            water</td>
            <td style="width: 158px;">money<br />
            news<br />
            measles (bệnh sởi)<br />
            soap&nbsp;</td>
            <td style="width: 158px;">information<br />
            air<br />
            mumps (bệnh quai bị)<br />
            economics</td>
            <td style="width: 158px;">physics<br />
            mathematics<br />
            politics<br />
            homework</td>
        </tr>
    </tbody>
</table>
<p>Note:&nbsp;<em>advertising</em>&nbsp;l&agrave; danh từ kh&ocirc;ng đếm được nhưng&nbsp;<em>advertisement</em>&nbsp;l&agrave; danh từ đếm được, chỉ một quảng c&aacute;o cụ thể n&agrave;o đ&oacute;.&nbsp;<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are too many&nbsp;<span style="text-decoration: underline;">advertisements</span>&nbsp;during TV shows.</p>
<h3><span style="color: #0070c0;"><a name="2.2">2.2</a>&nbsp;C&aacute;ch d&ugrave;ng qu&aacute;n từ kh&ocirc;ng x&aacute;c định "a" v&agrave; "an"</span></h3>
<p>D&ugrave;ng a hoặc an trước một danh từ số &iacute;t đếm được. Ch&uacute;ng c&oacute; nghĩa l&agrave; một. Ch&uacute;ng được d&ugrave;ng trong c&acirc;u c&oacute; t&iacute;nh kh&aacute;i qu&aacute;t hoặc đề cập đến một chủ thể chưa được đề cập từ trước.<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">A ball</span>&nbsp;is round. (nghĩa chung, kh&aacute;i qu&aacute;t, chỉ tất cả c&aacute;c quả b&oacute;ng)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I saw&nbsp;<span style="text-decoration: underline;">a boy</span>&nbsp;in the street. (ch&uacute;ng ta kh&ocirc;ng biết cậu b&eacute; n&agrave;o, chưa được đề cập trước đ&oacute;)</p>
<h4><span style="color: #0070c0;"><a name="2.2.1">2.2.1</a>&nbsp;D&ugrave;ng &ldquo;an&rdquo; với:</span></h4>
<p>Qu&aacute;n từ&nbsp;<em>an</em>&nbsp;được d&ugrave;ng trước từ bắt đầu bằng nguy&ecirc;n &acirc;m (trong c&aacute;ch ph&aacute;t &acirc;m, chứ kh&ocirc;ng phải trong c&aacute;ch viết). Bao gồm:<br />
<br />
&middot; C&aacute;c từ bắt đầu bằng c&aacute;c nguy&ecirc;n &acirc;m a, e, i, o: an aircraft, an empty glass, an object&nbsp;<br />
&middot; Một số từ bắt đầu bằng u, y: an uncle, an umbrella&nbsp;<br />
&middot; Một số từ bắt đầu bằng h c&acirc;m: an heir, haft an hour&nbsp;&nbsp;<br />
&middot; C&aacute;c từ mở đầu bằng một chữ viết tắt: an S.O.S/ an M.P</p>
<h4><span style="color: #0070c0;"><a name="2.2.2">2.2.2</a>&nbsp;D&ugrave;ng &ldquo;a&rdquo; với:</span></h4>
<p>D&ugrave;ng&nbsp;<em>a</em>&nbsp;trước c&aacute;c từ bắt đầu bằng một phụ &acirc;m. Ch&uacute;ng bao gồm c&aacute;c chữ c&aacute;i c&ograve;n lại v&agrave; một số trường hợp bắt đầu bằng u, y, h. VD: a house, a university, a home party, a heavy load, a uniform, a union, a year income,...<br />
<br />
&middot; Đứng trước một danh từ mở đầu bằng "uni..." phải d&ugrave;ng "a" (a university/ a uniform/ universal/ union) (Europe, eulogy (lời ca ngợi), euphemism (lối n&oacute;i trại), eucalyptus (c&acirc;y khuynh diệp)&nbsp;<br />
&middot; D&ugrave;ng trong c&aacute;c th&agrave;nh ngữ chỉ số lượng nhất định như: a lot of/a great deal of/a couple/a dozen.&nbsp;&nbsp;<br />
&middot; D&ugrave;ng trước những số đếm nhất định thường l&agrave; h&agrave;ng ng&agrave;n, h&agrave;ng trăm như a/one hundred - a/one thousand.&nbsp;&nbsp;<br />
&middot; D&ugrave;ng trước "half" (một nửa) khi n&oacute; theo sau một đơn vị nguy&ecirc;n vẹn: a kilo and a half, hay khi n&oacute; đi gh&eacute;p với một danh từ kh&aacute;c để chỉ nửa phần (khi viết c&oacute; dấu gạch nối): a half - share, a half - holiday (ng&agrave;y lễ chỉ nghỉ nửa ng&agrave;y).&nbsp;&nbsp;<br />
&middot; D&ugrave;ng với c&aacute;c đơn vị ph&acirc;n số như 1/3 a/one third - 1/5 a /one fifth.&nbsp;&nbsp;<br />
&middot; D&ugrave;ng trong c&aacute;c th&agrave;nh ngữ chỉ gi&aacute; cả, tốc độ, tỉ lệ: $5 a kilo, 60 kilometers an hour, 4 times a day.&nbsp;</p>
<h3><span style="color: #0070c0;"><a name="2.3">2.3</a>&nbsp;C&aacute;ch d&ugrave;ng qu&aacute;n từ x&aacute;c định "The"</span></h3>
<p>D&ugrave;ng&nbsp;<em>the</em>&nbsp;trước một danh từ đ&atilde; được x&aacute;c định cụ thể về mặt t&iacute;nh chất, đặc điểm, vị tr&iacute; hoặc đ&atilde; được đề cập đến trước đ&oacute;, hoặc những kh&aacute;i niệm phổ th&ocirc;ng, ai cũng biết.</p>
<blockquote>
<p><span style="text-decoration: underline;">The boy</span>&nbsp;in the corner is my friend. (Cả người n&oacute;i v&agrave; người nghe đều biết đ&oacute; l&agrave; cậu b&eacute; n&agrave;o)<br />
<span style="text-decoration: underline;">The earth</span>&nbsp;is round. (Chỉ c&oacute; một tr&aacute;i đất, ai cũng biết)</p>
</blockquote>
<p>Với danh từ kh&ocirc;ng đếm được, d&ugrave;ng the nếu n&oacute;i đến một vật cụ thể, kh&ocirc;ng d&ugrave;ng the nếu n&oacute;i chung.<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Sugar is sweet. (Chỉ c&aacute;c loại đường n&oacute;i chung)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The sugar</span>&nbsp;on the table is from Cuba. (Cụ thể l&agrave; đường ở tr&ecirc;n b&agrave;n)<br />
<br />
Với danh từ đếm được số nhiều, khi ch&uacute;ng c&oacute; nghĩa đại diện chung cho một lớp c&aacute;c vật c&ugrave;ng loại th&igrave; cũng kh&ocirc;ng d&ugrave;ng&nbsp;<em>the</em>.<br />
<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Oranges</span>&nbsp;are green until they ripen. (Cam n&oacute;i chung)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Athletes</span>&nbsp;should follow a well-balanced diet. (Vận động vi&ecirc;n n&oacute;i chung)</p>
<h4><span style="color: #0070c0;"><a name="2.3.1">2.3.1</a>&nbsp;Sau đ&acirc;y l&agrave; một số trường hợp th&ocirc;ng dụng d&ugrave;ng&nbsp;<em>The</em>&nbsp;theo quy tắc tr&ecirc;n:&nbsp;</span></h4>
<p>&middot; The + danh từ + giới từ + danh từ: The girl in blue, the Gulf of Mexico.&nbsp;<br />
&middot; D&ugrave;ng trước những t&iacute;nh từ so s&aacute;nh bậc nhất hoặc only: The only way, the best day.&nbsp;<br />
&middot; D&ugrave;ng cho những khoảng thời gian x&aacute;c định (thập ni&ecirc;n): In the 1990s&nbsp;&nbsp;<br />
&middot; The + danh từ + đại từ quan hệ + mệnh đề phụ: The man to whom you have just spoken is the chairman.&nbsp;<br />
&middot; The + danh từ số &iacute;t tượng trưng cho một nh&oacute;m th&uacute; vật hoặc đồ vật: The whale = whales (lo&agrave;i c&aacute; voi), the deep-freeze (thức ăn đ&ocirc;ng lạnh)&nbsp;&nbsp;<br />
&middot; Đối với&nbsp;<em>man</em>&nbsp;khi mang nghĩa "lo&agrave;i người" tuyệt đối kh&ocirc;ng được d&ugrave;ng the: Since man lived on the earth ... (kể từ khi lo&agrave;i người sinh sống tr&ecirc;n tr&aacute;i đất n&agrave;y)&nbsp;&nbsp;<br />
&middot; D&ugrave;ng trước một danh từ số &iacute;t để chỉ một nh&oacute;m, một hạng người nhất định trong x&atilde; hội: The small shopkeeper: Giới chủ tiệm nhỏ/ The top offcial: Giới quan chức cao cấp&nbsp;&nbsp;<br />
&middot; The + adj: Tượng trưng cho một nh&oacute;m người, ch&uacute;ng kh&ocirc;ng bao giờ được ph&eacute;p ở số nhiều nhưng được xem l&agrave; c&aacute;c danh từ số nhiều. Do vậy động từ v&agrave; đại từ đi c&ugrave;ng với ch&uacute;ng phải ở ng&ocirc;i thứ 3 số nhiều: The old = The old people;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The old</span>&nbsp;<em>are</em>&nbsp;often very hard in their moving&nbsp;&nbsp;<br />
&middot; The + t&ecirc;n gọi c&aacute;c đội hợp xướng/ d&agrave;n nhạc cổ điển/ ban nhạc phổ th&ocirc;ng: The Back Choir/ The Philharmonique Philadelphia Orchestra/ The Beatles.&nbsp;&nbsp;<br />
&middot; The + t&ecirc;n gọi c&aacute;c tờ b&aacute;o (kh&ocirc;ng tạp ch&iacute;)/ t&agrave;u biển/ c&aacute;c khinh kh&iacute; cầu: The Times/ The Titanic/ The Hindenberg&nbsp;&nbsp;<br />
&middot; The + họ của một gia đ&igrave;nh ở số nhiều =&nbsp;<em>gia đ&igrave;nh nh&agrave;</em>: The Smiths = Mr/ Mrs Smith and children&nbsp;&nbsp;<br />
&middot; Th&ocirc;ng thường kh&ocirc;ng d&ugrave;ng the trước t&ecirc;n ri&ecirc;ng trừ trường hợp c&oacute; nhiều người hoặc vật c&ugrave;ng t&ecirc;n v&agrave; người n&oacute;i muốn &aacute;m chỉ một người cụ thể trong số đ&oacute;:&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There are three Sunsan Parkers in the telephone directory.&nbsp;<span style="text-decoration: underline;">The Sunsan Parker</span>&nbsp;that I know lives on the First Avenue.&nbsp;<br />
&middot; Tương tự, kh&ocirc;ng d&ugrave;ng "the" trước bữa ăn: breakfast, lunch, dinner:&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; We ate&nbsp;<span style="text-decoration: underline;">breakfast</span>&nbsp;at 8 am this morning.&nbsp;<br />
Trừ khi muốn &aacute;m chỉ một bữa ăn cụ thể:&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The dinner</span>&nbsp;that you invited me last week were delecious.&nbsp;&nbsp;<br />
&middot; Kh&ocirc;ng d&ugrave;ng "the" trước một số danh từ như home, bed, church, court, jail, prison, hospital, school, class, college, university v.v... khi n&oacute; đi với c&aacute;c động từ v&agrave; giới từ chỉ chuyển động chỉ đi đến đ&oacute; l&agrave; mục đ&iacute;ch ch&iacute;nh hoặc ra khỏi đ&oacute; cũng v&igrave; mục đ&iacute;ch ch&iacute;nh:&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Students go to&nbsp;<span style="text-decoration: underline;">school</span>&nbsp;everyday.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The patient was released from&nbsp;<span style="text-decoration: underline;">hospital</span>.&nbsp;<br />
Nhưng nếu đến đ&oacute; hoặc ra khỏi đ&oacute; kh&ocirc;ng v&igrave; mục đ&iacute;ch ch&iacute;nh th&igrave; d&ugrave;ng "the".&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Students go to&nbsp;<span style="text-decoration: underline;">the school</span>&nbsp;for a class party.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The doctor left&nbsp;<span style="text-decoration: underline;">the hospital</span>&nbsp;for lunch.&nbsp;</p>
<h4 style="text-align: left;"><span style="color: #0070c0;"><a name="2.3.2">2.3.2</a>&nbsp;Bảng sử dụng "the" v&agrave; kh&ocirc;ng sử dụng "the" trong một số trường hợp điển h&igrave;nh</span></h4>
<table border="1" width="100%">
    <tbody>
        <tr>
            <td style="width: 319px;"><strong>C&oacute; "The"&nbsp;</strong></td>
            <td style="width: 319px;"><strong>Kh&ocirc;ng "The"&nbsp;</strong></td>
        </tr>
        <tr>
            <td valign="top" style="width: 319px;">+ D&ugrave;ng trước t&ecirc;n c&aacute;c đại dương, s&ocirc;ng ng&ograve;i, biển, vịnh v&agrave; c&aacute;c cụm hồ (số nhiều)<br />
            The Red Sea, the Atlantic Ocean, the Persian Gufl, the Great Lakes&nbsp;
            <p>+ Trước t&ecirc;n c&aacute;c d&atilde;y n&uacute;i:<br />
            The Rocky Mountains&nbsp;<br />
            <br />
            + Trước t&ecirc;n những vật thể duy nhất trong vũ trụ hoặc tr&ecirc;n thế giới:<br />
            The earth, the moon&nbsp;<br />
            <br />
            + The schools, colleges, universities + of + danh từ ri&ecirc;ng&nbsp;<br />
            The University of Florida&nbsp;<br />
            <br />
            + The + số thứ tự + danh từ&nbsp;<br />
            The third chapter.&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c cuộc chiến tranh khu vực với điều kiện t&ecirc;n khu vực đ&oacute; phải được t&iacute;nh từ ho&aacute;&nbsp;<br />
            The Korean War (=&gt; The Vietnamese economy)&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c nước c&oacute; hai từ trở l&ecirc;n (ngoại trừ<em>Great</em>&nbsp;<em>Britain</em>)&nbsp;<br />
            The United States, The Central African Republic&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c nước được coi l&agrave; một quần đảo hoặc một quần đảo&nbsp;<br />
            The Philipines, The Virgin Islands, The Hawaii&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c t&agrave;i liệu hoặc sự kiện lịch sử&nbsp;<br />
            The Constitution, The Magna Carta&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c nh&oacute;m d&acirc;n tộc thiểu số&nbsp;<br />
            the Indians&nbsp;<br />
            <br />
            <br />
            <br />
            <br />
            <br />
            <br />
            + Trước t&ecirc;n c&aacute;c m&ocirc;n học cụ thể&nbsp;<br />
            The Solid matter Physics&nbsp;<br />
            <br />
            <br />
            <br />
            <br />
            + Trước t&ecirc;n c&aacute;c nhạc cụ khi đề cập đến c&aacute;c nhạc cụ đ&oacute; n&oacute;i chung hoặc khi chơi c&aacute;c nhạc cụ đ&oacute;.&nbsp;<br />
            The violin is difficult to play&nbsp;<br />
            Who is that on the piano&nbsp;</p>
            </td>
            <td valign="top" style="width: 319px;">+ Trước t&ecirc;n một hồ&nbsp;<br />
            Lake Geneva&nbsp;<br />
            <br />
            <br />
            <br />
            + Trước t&ecirc;n một ngọn n&uacute;i&nbsp;<br />
            Mount Vesuvius&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c h&agrave;nh tinh hoặc c&aacute;c ch&ograve;m sao&nbsp;<br />
            Venus, Mars&nbsp;<br />
            <br />
            <br />
            + Trước t&ecirc;n c&aacute;c trường n&agrave;y nếu trước n&oacute; l&agrave; một t&ecirc;n ri&ecirc;ng&nbsp;<br />
            Stetson University&nbsp;<br />
            <br />
            + Trước c&aacute;c danh từ đi c&ugrave;ng với một số đếm&nbsp;<br />
            Chapter three, Word War One&nbsp;<br />
            <br />
            <br />
            <br />
            <br />
            <br />
            + Trước t&ecirc;n c&aacute;c nước chỉ c&oacute; một từ:&nbsp;<br />
            China, France, Venezuela, Vietnam<br />
            <br />
            <br />
            + Trước t&ecirc;n c&aacute;c nước mở đầu bằng New, một t&iacute;nh từ chỉ hướng:&nbsp;<br />
            New Zealand, North Korean, France&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c lục địa, tỉnh, tiểu bang, th&agrave;nh phố, quận, huyện:<br />
            Europe, Florida&nbsp;<br />
            <br />
            + Trước t&ecirc;n bất k&igrave; m&ocirc;n thể thao n&agrave;o&nbsp;<br />
            baseball, basketball&nbsp;<br />
            <br />
            + Trước c&aacute;c danh từ trừu tượng (trừ một số trường hợp đặc biệt):<br />
            freedom, happiness&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c m&ocirc;n học n&oacute;i chung&nbsp;<br />
            mathematics&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c ng&agrave;y lễ, tết&nbsp;<br />
            Christmas, Thanksgiving&nbsp;<br />
            <br />
            + Trước t&ecirc;n c&aacute;c loại h&igrave;nh nhạc cụ trong c&aacute;c h&igrave;nh thức &acirc;m nhạc cụ thể (Jazz, Rock, classical music..)&nbsp;<br />
            To perform jazz on trumpet and piano&nbsp;</td>
        </tr>
    </tbody>
</table>
<h3><span style="color: #0070c0;"><a name="2.4">2.4</a>&nbsp;C&aacute;ch sử dụng another v&agrave; other.</span></h3>
<p>Hai từ n&agrave;y thường g&acirc;y nhầm lẫn.&nbsp;</p>
<table border="1" width="100%">
    <tbody>
        <tr>
            <td align="center" style="width: 391px;"><strong>D&ugrave;ng với danh từ đếm được</strong></td>
            <td align="center" style="width: 247px;"><strong>D&ugrave;ng với danh từ kh&ocirc;ng đếm được</strong></td>
        </tr>
        <tr>
            <td style="width: 391px;">
            <ul>
                <li>an + other +&nbsp;<em>danh từ đếm được số &iacute;t</em>&nbsp;= một c&aacute;i nữa, một c&aacute;i kh&aacute;c, một người nữa, một người kh&aacute;c (= one more).<br />
                another pencil = one more pencil</li>
                <li>the other +&nbsp;<em>danh từ đếm được số &iacute;t</em>&nbsp;= c&aacute;i cuối c&ugrave;ng c&ograve;n lại (của một bộ), người c&ograve;n lại (của một nh&oacute;m), = last of the set.<br />
                the other pencil = the last pencil present</li>
            </ul>
            </td>
            <td style="width: 247px;">
            <p style="text-align: center;">Kh&ocirc;ng d&ugrave;ng</p>
            </td>
        </tr>
        <tr>
            <td style="width: 391px;">
            <ul>
                <li>Other +&nbsp;<em>danh từ đếm được số nhiều</em>&nbsp;= mấy c&aacute;i nữa, mấy c&aacute;i kh&aacute;c, mấy người nữa, mấy người kh&aacute;c (= more of the set).<br />
                other pencils = some more pencils</li>
                <li>The other +&nbsp;<em>danh từ đếm được số nhiều</em>&nbsp;= những c&aacute;i c&ograve;n lại (của một bộ), những người c&ograve;n lại (của một nh&oacute;m), = the rest of the set.<br />
                the other pencils = all remaining pencils</li>
            </ul>
            </td>
            <td style="width: 247px;">
            <ul>
                <li>Other +&nbsp;<em>danh từ kh&ocirc;ng đếm được</em>&nbsp;= một ch&uacute;t nữa (= more of the set).<br />
                other water = some more water</li>
                <li>The other +&nbsp;<em>danh từ kh&ocirc;ng đếm được</em>&nbsp;= chỗ c&ograve;n s&oacute;t lại.<br />
                the other water = the remaining water</li>
            </ul>
            </td>
        </tr>
    </tbody>
</table>
<p>&middot;&nbsp;<em>Another</em>&nbsp;v&agrave;&nbsp;<em>other</em>&nbsp;l&agrave; kh&ocirc;ng x&aacute;c định trong khi&nbsp;<em>the other</em>&nbsp;l&agrave; x&aacute;c định; nếu chủ ngữ l&agrave; đ&atilde; biết (được nhắc đến trước đ&oacute;) th&igrave; ta c&oacute; thể bỏ danh từ đi sau&nbsp;<em>another</em>&nbsp;hoặc&nbsp;<em>other</em>, chỉ cần d&ugrave;ng&nbsp;<em>another</em>&nbsp;hoặc&nbsp;<em>other</em>&nbsp;như một đại từ l&agrave; đủ.&nbsp;Khi danh từ số nhiều bị lược bớt (trong c&aacute;ch n&oacute;i tắt n&ecirc;u tr&ecirc;n) th&igrave;&nbsp;<em>other</em>&nbsp;trở th&agrave;nh&nbsp;<em>others</em>. Kh&ocirc;ng bao giờ được d&ugrave;ng&nbsp;<em>others</em>&nbsp;+ danh từ số nhiều:</p>
<blockquote>
<p>I Don 't want this book. Please give me&nbsp;<span style="text-decoration: underline;">another</span>.<br />
(another = any other book - not specific)&nbsp;<br />
<br />
I Don 't want this book. Please give me&nbsp;<span style="text-decoration: underline;">the other</span>.&nbsp;<br />
(the other = the other book, specific)&nbsp;<br />
<br />
This chemical is poisonous.&nbsp;<span style="text-decoration: underline;">Others</span>&nbsp;are poisonous too.<br />
(others = the other chemicals, not specific)&nbsp;<br />
<br />
I Don 't want these books. Please give me&nbsp;<span style="text-decoration: underline;">the others</span>.&nbsp;<br />
(the others = the other books, specific)&nbsp;</p>
</blockquote>
<p>&middot; Trong một số trường hợp người ta d&ugrave;ng&nbsp;<em>one</em>&nbsp;hoặc&nbsp;<em>ones</em>&nbsp;đằng sau another hoặc other thay cho danh từ:</p>
<blockquote>
<p>I Don 't want this book. Please give me&nbsp;<span style="text-decoration: underline;">another one</span>.<br />
I don't want this book. Please give me the&nbsp;<span style="text-decoration: underline;">other one</span>.&nbsp;<br />
This chemical is poisonous.&nbsp;<span style="text-decoration: underline;">Other ones</span>&nbsp;are poisonous too.<br />
I don't want these books. Please give me the&nbsp;<span style="text-decoration: underline;">other ones</span>.&nbsp;</p>
</blockquote>
<p>&middot;&nbsp;<em>This</em>&nbsp;hoặc&nbsp;<em>that</em>&nbsp;c&oacute; thể d&ugrave;ng với&nbsp;<em>one</em>&nbsp;nhưng&nbsp;<em>these</em>&nbsp;v&agrave;&nbsp;<em>those</em>&nbsp;kh&ocirc;ng được d&ugrave;ng với&nbsp;<em>ones</em>, mặc d&ugrave; cả 4 từ n&agrave;y đều c&oacute; thể d&ugrave;ng thay cho danh từ (với vai tr&ograve; l&agrave; đại từ) khi kh&ocirc;ng đi với&nbsp;<em>one</em>&nbsp;hoặc&nbsp;<em>ones</em>:&nbsp;</p>
<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I don't want this book. I want&nbsp;<span style="text-decoration: underline;">that</span>.&nbsp;</p>
<h3><span style="color: #0070c0;"><a name="2.5">2.5</a>&nbsp;C&aacute;ch sử dụng little, a little, few, a few</span></h3>
<p>&middot; Little +&nbsp;<em>danh từ kh&ocirc;ng đếm được</em>: rất &iacute;t, kh&ocirc;ng đủ để (c&oacute; khuynh hướng phủ định)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have&nbsp;<span style="text-decoration: underline;">little money</span>,&nbsp;<span style="text-decoration: underline;">not enough</span>&nbsp;to buy groceries.<br />
<br />
&middot; A little +&nbsp;<em>danh từ kh&ocirc;ng đếm được</em>: c&oacute; một ch&uacute;t, đủ để<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have&nbsp;<span style="text-decoration: underline;">a little money</span>,&nbsp;<span style="text-decoration: underline;">enough</span>&nbsp;to buy groceries<br />
<br />
&middot; Few +&nbsp;<em>danh từ đếm được số nhiều</em>: c&oacute; rất &iacute;t, kh&ocirc;ng đủ để (c&oacute; t&iacute;nh phủ định)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have&nbsp;<span style="text-decoration: underline;">few books</span>,&nbsp;<span style="text-decoration: underline;">not enough</span>&nbsp;for reference reading<br />
<br />
&middot; A few + danh từ đếm được số nhiều: c&oacute; một ch&uacute;t, đủ để<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I have&nbsp;<span style="text-decoration: underline;">a few records</span>,&nbsp;<span style="text-decoration: underline;">enough</span>&nbsp;for listening.<br />
<br />
&middot; Trong một số trường hợp khi danh từ ở tr&ecirc;n đ&atilde; được nhắc đến th&igrave; ở ph&iacute;a dưới chỉ cần d&ugrave;ng little hoặc few như một đại từ l&agrave; đủ (cũng giống như đối với other/another; this/that).<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Are you ready in money. Yes,&nbsp;<span style="text-decoration: underline;">a little</span>.<br />
<br />
&middot; Quite a few +&nbsp;<em>đếm được</em>&nbsp;= Quite a bit +&nbsp;<em>kh&ocirc;ng đếm được</em>&nbsp;= Quite a lot of +&nbsp;<em>noun</em>&nbsp;= rất nhiều.</p>
<h3><span style="color: #0070c0;"><a name="2.6">2.6</a>&nbsp;Sở hữu c&aacute;ch</span></h3>
<p>&middot; The noun's + noun: Chỉ được d&ugrave;ng cho những danh từ chỉ người hoặc động vật, kh&ocirc;ng d&ugrave;ng cho c&aacute;c đồ vật.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">student's</span>&nbsp;book,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">cat's</span>&nbsp;legs.<br />
<br />
&middot; Đối với danh từ số nhiều đ&atilde; c&oacute; sẵn "s" ở đu&ocirc;i chỉ cần d&ugrave;ng dấu phẩy<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">students'</span>&nbsp;book.<br />
<br />
&middot; Nhưng đối với những danh từ đổi số nhiều đặc biệt kh&ocirc;ng "s" ở đu&ocirc;i vẫn phải d&ugrave;ng đầy đủ dấu sở hữu c&aacute;ch.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The c<span style="text-decoration: underline;">hildren's</span>&nbsp;toys,&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">people's</span>&nbsp;willing<br />
<br />
&middot; Nếu c&oacute; hai danh từ c&ugrave;ng đứng ở sở hữu c&aacute;ch th&igrave; danh từ n&agrave;o đứng gần danh từ bị sở hữu nhất sẽ mang dấu sở hữu.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Paul and Peter's</span>&nbsp;room.<br />
<br />
&middot; Đối với những t&ecirc;n ri&ecirc;ng hoặc danh từ đ&atilde; c&oacute; sẵn "s" ở đu&ocirc;i c&oacute; thể chỉ cần d&ugrave;ng dấu phẩy v&agrave; nhấn mạnh đu&ocirc;i khi đọc hoặc d&ugrave;ng sở hữu c&aacute;ch v&agrave; phải thay đổi c&aacute;ch đọc. T&ecirc;n ri&ecirc;ng kh&ocirc;ng d&ugrave;ng "the" đằng trước.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">boss'</span>&nbsp;car = the&nbsp;<strong><span style="text-decoration: underline;">boss 's</span></strong>&nbsp;car [bosiz]<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Agnes'</span>&nbsp;house =&nbsp;<strong><span style="text-decoration: underline;">Agnes 's</span></strong>&nbsp;[siz] house.<br />
<br />
&middot; Sở hữu c&aacute;ch cũng được d&ugrave;ng cho thời gian (năm, th&aacute;ng, thập ni&ecirc;n, thế kỉ)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The 1990s'</span>&nbsp;events: những sự kiện của thập ni&ecirc;n 90<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The 21st century's</span>&nbsp;prospects.<br />
<br />
&middot; D&ugrave;ng cho c&aacute;c m&ugrave;a trong năm trừ m&ugrave;a xu&acirc;n v&agrave; m&ugrave;a thu. Nếu d&ugrave;ng sở hữu c&aacute;ch cho hai m&ugrave;a n&agrave;y th&igrave; người viết đ&atilde; nh&acirc;n c&aacute;ch ho&aacute; ch&uacute;ng. Ng&agrave;y nay người ta d&ugrave;ng c&aacute;c m&ugrave;a trong năm như một t&iacute;nh từ cho c&aacute;c danh từ đằng sau, &iacute;t d&ugrave;ng sở hữu c&aacute;ch.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The Autumn's leaf</span>: chiếc l&aacute; của n&agrave;ng thu.<br />
<br />
&middot; D&ugrave;ng cho t&ecirc;n c&aacute;c c&ocirc;ng ty lớn, c&aacute;c quốc gia<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">The Rockerfeller's</span>&nbsp;oil products.&nbsp;<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">China's</span>&nbsp;food.<br />
<br />
&middot; Đối với c&aacute;c cửa hiệu c&oacute; nghề nghiệp đặc trưng chỉ cần d&ugrave;ng danh từ với dấu sở hữu.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In a&nbsp;<span style="text-decoration: underline;">florist's</span><br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; At a&nbsp;<span style="text-decoration: underline;">hairdresser's</span><br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Đặc biệt l&agrave; c&aacute;c tiệm ăn với t&ecirc;n ri&ecirc;ng: The&nbsp;<span style="text-decoration: underline;">Antonio's</span><br />
<br />
&middot; D&ugrave;ng trước một số danh từ bất động vật chỉ trong một số th&agrave;nh ngữ<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; a&nbsp;<span style="text-decoration: underline;">stone's</span>&nbsp;throw from ...(C&aacute;ch nơi đ&acirc;u một tầm đ&aacute; n&eacute;m).<br />
<br />
<br />
</p>
	</body>
</html>