<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26">26</a>. C&acirc;u phức hợp v&agrave; đại từ quan hệ</span></h2>
<p style="margin-top: 12px;">Tiếng Anh c&oacute; 2 loại c&acirc;u:<br />
-&nbsp;<em>C&acirc;u đơn giản</em>: l&agrave; c&acirc;u c&oacute; 1 th&agrave;nh phần v&agrave; chỉ cần như vậy c&acirc;u cũng đ&atilde; đủ nghĩa.<br />
-&nbsp;<em>C&acirc;u phức hợp</em>: l&agrave; loại c&acirc;u c&oacute; 2 th&agrave;nh phần (2 mệnh đề) ch&iacute;nh/phụ nối với nhau bằng một từ gọi l&agrave; đại từ quan hệ.</p>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.1">26.1</a>&nbsp;That v&agrave; which l&agrave;m chủ ngữ của mệnh đề phụ</span></h3>
<p style="margin-top: 12px;">N&oacute; đứng đầu c&acirc;u phụ, thay thế cho danh từ bất động vật đứng trước n&oacute; v&agrave; đ&oacute;ng vai tr&ograve; chủ ngữ của c&acirc;u phụ. Trong trường hợp n&agrave;y kh&ocirc;ng thể lược bỏ&nbsp;<em>that</em>&nbsp;hoặc&nbsp;<em>which</em>:</p>
<blockquote>
<p style="margin-top: 12px;">We bought&nbsp;<span style="text-decoration: underline;">the stereo</span>&nbsp;<span style="text-decoration: underline;"><strong>that</strong></span>&nbsp;<span style="text-decoration: underline;">had been advertised</span>&nbsp;at a reduced price.<br />
(We bought the stereo.&nbsp;<em>It</em>&nbsp;had been advertised at a reduced price)</p>
</blockquote>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.2">26.2</a>&nbsp;That v&agrave; which l&agrave;m t&acirc;n ngữ của mệnh đề phụ</span></h3>
<p style="margin-top: 12px;">N&oacute; thay thế cho danh từ bất động vật đứng trước n&oacute;, mở đầu c&acirc;u phụ nhưng đ&oacute;ng vai tr&ograve; t&acirc;n ngữ trong c&acirc;u phụ. Trong trường hợp n&agrave;y c&oacute; thể lược bỏ&nbsp;<em>that</em>&nbsp;hoặc&nbsp;<em>which</em>:</p>
<blockquote>
<p style="margin-top: 12px;">George is going to buy&nbsp;<span style="text-decoration: underline;">the house</span>&nbsp;(<strong><span style="text-decoration: line-through;">that</span></strong>)&nbsp;<span style="text-decoration: underline;">we have been thinking of buying</span>.<br />
(George is going to buy a house. We have been thinking of buying&nbsp;<em>it</em>.)</p>
</blockquote>
<p style="margin-top: 12px;">Người ta d&ugrave;ng&nbsp;<em>that</em>&nbsp;chứ kh&ocirc;ng d&ugrave;ng&nbsp;<em>which</em>&nbsp;khi:<br />
+ Đứng trước n&oacute; l&agrave; một t&iacute;nh từ so s&aacute;nh bậc nhất + danh từ<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; That is&nbsp;<span style="text-decoration: underline;">the best novel</span>&nbsp;<span style="text-decoration: underline;">that</span>&nbsp;has been written by this author.<br />
+ Khi đằng trước n&oacute; l&agrave; một số c&aacute;c đại từ phiếm chỉ như&nbsp;<em>all, some, any, anything, everything, much, little, nothing</em>&nbsp;v.v..<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I want to see&nbsp;<span style="text-decoration: underline;">all</span>&nbsp;<span style="text-decoration: underline;">that</span>&nbsp;he possesses.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">All the apples</span>&nbsp;<span style="text-decoration: underline;">that</span>&nbsp;fall are eaten by pig.</p>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.3">26.3</a>&nbsp;Who l&agrave;m chủ ngữ của mệnh đề phụ</span></h3>
<p style="margin-top: 12px;">N&oacute; thay thế cho danh từ chỉ người hoặc động vật đứng trước n&oacute; v&agrave; đ&oacute;ng vai tr&ograve; chủ ngữ của c&acirc;u phụ. Trong trường hợp n&agrave;y kh&ocirc;ng thể lược bỏ&nbsp;<em>who</em>:</p>
<p style="margin-top: 12px;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The man&nbsp;<span style="text-decoration: underline;"><strong>who</strong>&nbsp;is in this room</span>&nbsp;is angry.</p>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.4">26.4</a>&nbsp;Whom l&agrave;m t&acirc;n ngữ của mệnh đề phụ</span></h3>
<p style="margin-top: 12px;">N&oacute; thay thế cho danh từ chỉ người hoặc động vật (động vật nu&ocirc;i trong nh&agrave;) đứng trước n&oacute; v&agrave; đ&oacute;ng tr&ograve; t&acirc;n ngữ của c&acirc;u phụ; n&oacute; c&oacute; thể bỏ đi được.</p>
<blockquote>
<p style="margin-top: 12px;">The men (<span style="text-decoration: line-through;">whom</span>) I don't like are angry.</p>
</blockquote>
<p style="margin-top: 12px;">Nếu&nbsp;<em>whom</em>&nbsp;l&agrave;m t&acirc;n ngữ của một ngữ động từ bao gồm&nbsp;<em>1</em>&nbsp;<em>Verb + 1 giới từ</em>&nbsp;th&igrave; lối viết chuẩn nhất l&agrave; đưa giới từ đ&oacute; l&ecirc;n trước&nbsp;<em>whom</em>.</p>
<blockquote>
<p style="margin-top: 12px;">The man&nbsp;<span style="text-decoration: underline;">to whom</span>&nbsp;you have just talked is the chairman of the company.</p>
</blockquote>
<p style="margin-top: 12px;">Tuy nhi&ecirc;n nếu&nbsp;<em>whom</em>&nbsp;l&agrave; t&acirc;n ngữ của một ngữ động từ bao gồm&nbsp;<em>1 động từ + 2 giới từ</em>&nbsp;th&igrave; 2 giới từ đ&oacute; vẫn phải đứng đằng sau động từ.</p>
<blockquote>
<p style="margin-top: 12px;">The man&nbsp;<span style="text-decoration: underline;">whom</span>&nbsp;you are looking&nbsp;<span style="text-decoration: underline;">forward to</span>&nbsp;is the chairman of the company.</p>
</blockquote>
<p style="margin-top: 12px;">Kh&ocirc;ng được d&ugrave;ng&nbsp;<em>who</em>&nbsp;thay cho&nbsp;<em>whom</em>&nbsp;trong văn viết d&ugrave; n&oacute; được chấp nhận trong văn n&oacute;i.</p>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.5">26.5</a>&nbsp;Mệnh đề phụ bắt buộc v&agrave; kh&ocirc;ng bắt buộc.</span></h3>
<h4 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.5.1">26.5.1</a>&nbsp;Mệnh đề phụ bắt buộc.</span></h4>
<p style="margin-top: 12px;">L&agrave; loại mệnh đề bắt buộc phải c&oacute; mặt ở trong c&acirc;u, nếu bỏ đi c&acirc;u sẽ mất &yacute; nghĩa ban đầu. N&ecirc;n d&ugrave;ng&nbsp;<em>that</em>&nbsp;l&agrave;m chủ ngữ cho loại c&acirc;u n&agrave;y mặc d&ugrave;&nbsp;<em>which</em>&nbsp;vẫn được chấp nhận. C&acirc;u phụ thường đứng xen v&agrave;o giữa c&acirc;u ch&iacute;nh hoặc nối liền với c&acirc;u ch&iacute;nh v&agrave; kh&ocirc;ng t&aacute;ch rời khỏi n&oacute; bởi bất cứ dấu phảy n&agrave;o. Trong v&iacute; dụ sau nếu bỏ đi mệnh đề phụ được gạch ch&acirc;n th&igrave; c&acirc;u sẽ mang &yacute; nghĩa ho&agrave;n to&agrave;n kh&aacute;c:</p>
<blockquote>
<p style="margin-top: 12px;">Weeds&nbsp;<span style="text-decoration: underline;">that float to the surface</span>&nbsp;should be removed before they decay.</p>
</blockquote>
<h4 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.5.2">26.5.2</a>&nbsp;Mệnh đề phụ kh&ocirc;ng bắt buộc</span></h4>
<p style="margin-top: 12px;">L&agrave; loại mệnh đề mang th&ocirc;ng tin phụ trong c&acirc;u, nếu bỏ n&oacute; đi c&acirc;u kh&ocirc;ng mất nghĩa ban đầu. Kh&ocirc;ng được d&ugrave;ng<em>that</em>&nbsp;l&agrave;m chủ ngữ m&agrave; phải d&ugrave;ng&nbsp;<em>which</em>, cho d&ugrave;&nbsp;<em>which</em>&nbsp;c&oacute; l&agrave; t&acirc;n ngữ của mệnh đề phụ cũng kh&ocirc;ng được ph&eacute;p bỏ n&oacute; đi. C&acirc;u phụ thường đứng chen v&agrave;o giữa c&acirc;u ch&iacute;nh v&agrave; bắt buộc phải t&aacute;ch khỏi c&acirc;u ch&iacute;nh bằng 2 dấu phẩy. X&eacute;t hai v&iacute; dụ sau:</p>
<blockquote>
<p style="margin-top: 12px;">My car,&nbsp;<span style="text-decoration: underline;">which is very large</span>, uses too much gasoline.&nbsp;<br />
This rum,&nbsp;<span style="text-decoration: underline;">which I bought in the Virgin Islands</span>, is very smooth.</p>
</blockquote>
<h4 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.5.3">26.5.3</a>&nbsp;Tầm quan trọng của việc sử dụng dấu phẩy đối với mệnh đề phụ</span></h4>
<p style="margin-top: 12px;">Ở những mệnh đề phụ bắt buộc, khi kh&ocirc;ng d&ugrave;ng dấu phẩy tức l&agrave; mệnh đề phụ x&aacute;c định một giới hạn đối với danh từ đằng trước trong mệnh đề ch&iacute;nh</p>
<blockquote>
<p style="margin-top: 12px;">The travelers&nbsp;<span style="text-decoration: underline;">who knew about the flood</span>&nbsp;took another road. (Những người biết về trận lũ đều chọn đường kh&aacute;c)<br />
The wine&nbsp;<span style="text-decoration: underline;">that was stored in the cellar</span>&nbsp;was ruined.</p>
</blockquote>
<p style="margin-top: 12px;">Đối với những mệnh đề phụ kh&ocirc;ng bắt buộc, khi c&oacute; dấu phẩy ngăn c&aacute;ch th&igrave; n&oacute; kh&ocirc;ng x&aacute;c định giới hạn đối với danh từ đứng trước n&oacute;.&nbsp;</p>
<blockquote>
<p style="margin-top: 12px;">The travelers,&nbsp;<span style="text-decoration: underline;">who knew about the flood</span>, took another road. (Tất cả những người...)<br />
The wine,&nbsp;<span style="text-decoration: underline;">which was stored in the cellar</span>, was ruined.&nbsp;</p>
</blockquote>
<p style="margin-top: 12px;"><strong>Note</strong>: C&aacute;c nguy&ecirc;n tắc tr&ecirc;n đ&acirc;y chỉ d&ugrave;ng trong văn viết, kh&ocirc;ng d&ugrave;ng trong văn n&oacute;i. Lỗi ngữ ph&aacute;p của TOEFL kh&ocirc;ng t&iacute;nh đến mệnh đề phụ bắt buộc nhưng sẽ trừ điểm nếu phạm phải lỗi mệnh đề phụ kh&ocirc;ng bắt buộc.</p>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.6">26.6</a>&nbsp;C&aacute;ch sử dụng&nbsp;<em>All, Both, Some, Several, Most, Few + Of + Whom/ Which</em></span></h3>
<blockquote>
<p style="margin-top: 12px;">Her sons,&nbsp;<span style="text-decoration: underline;">both of whom</span>&nbsp;are working abroad, call her every week. (kh&ocirc;ng được n&oacute;i&nbsp;<em>both of them</em>)&nbsp;<br />
The buses,&nbsp;<span style="text-decoration: underline;">most of which</span>&nbsp;were full of passengers, began to pull out.</p>
</blockquote>
<p style="margin-top: 12px;">Tuyệt đối kh&ocirc;ng được d&ugrave;ng đại từ nh&acirc;n xưng t&acirc;n ngữ:&nbsp;<em>them, us</em>&nbsp;trong trường hợp n&agrave;y.</p>
<p style="margin-top: 12px;"><strong>- What</strong>&nbsp;(<em>the things that</em>) c&oacute; thể l&agrave;m t&acirc;n ngữ cho mệnh đề phụ c&ugrave;ng l&uacute;c l&agrave;m chủ ngữ cho mệnh đề ch&iacute;nh/ hoặc l&agrave;m chủ ngữ của cả 2 mệnh đề ch&iacute;nh, phụ:</p>
<blockquote>
<p style="margin-top: 12px;"><span style="text-decoration: underline;">What we have expected</span>&nbsp;<span style="text-decoration: underline;">is</span>&nbsp;the result of the test.<br />
<span style="text-decoration: underline;">What happened to him yesterday</span>&nbsp;<span style="text-decoration: underline;">might happen</span>&nbsp;to us tomorrow.</p>
</blockquote>
<p style="margin-top: 12px;">-&nbsp;<strong>Whose</strong>&nbsp;(của người m&agrave;, của con m&agrave;) c&oacute; thể thay thế cho danh từ chỉ người hoặc động vật ở trước n&oacute; v&agrave; chỉ sự sở hữu của người hoặc động vật đ&oacute; đối với danh từ đi sau.</p>
<blockquote>
<p style="margin-top: 12px;">James,&nbsp;<span style="text-decoration: underline;">whose father is the president of the company</span>, has received a promotion.</p>
</blockquote>
<p style="margin-top: 12px;">Trong lối văn viết trang trọng n&ecirc;n d&ugrave;ng of&nbsp;<em>which</em>&nbsp;để thay thế cho danh từ bất động vật mặc d&ugrave;&nbsp;<em>whose</em>&nbsp;vẫn được chấp nhận.</p>
<blockquote>
<p style="margin-top: 12px;">Savings account,&nbsp;<span style="text-decoration: underline;">of which</span>&nbsp; interest rate is quite hight, is very common now. (of which = whose)</p>
</blockquote>
<p style="margin-top: 12px;">Hoặc d&ugrave;ng&nbsp;<em>with + noun/ noun phrase</em>&nbsp;thay cho&nbsp;<em>whose</em></p>
<blockquote>
<p style="margin-top: 12px;">A house&nbsp;<span style="text-decoration: underline;">whose walls were made of glass</span>&nbsp;is easy to break = A house&nbsp;<span style="text-decoration: underline;">with glass walls</span>&nbsp;is easyto break.</p>
</blockquote>
<h3 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="26.7">26.7</a>&nbsp;C&aacute;ch loại bỏ đại từ quan hệ trong mệnh đề phụ</span></h3>
<p style="margin-top: 12px;">Đối với những mệnh đề phụ bắt buộc người ta c&oacute; thể (kh&ocirc;ng bắt buộc) loại bỏ đại từ quan hệ v&agrave; động từ&nbsp;<em>to be</em>&nbsp;(c&ugrave;ng với c&aacute;c trợ động từ của n&oacute;) trong một số trường hợp sau:</p>
<ul>
    <li>
    <p style="margin-top: 12px;">Trước một mệnh đề phụ m&agrave; cấu tr&uacute;c động từ ở thời bị động.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; This is the value of X (<span style="text-decoration: line-through;">which was</span>)&nbsp;<span style="text-decoration: underline;">obtained</span>&nbsp;from the areas under the normal curve.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Trước một mệnh đề phụ m&agrave; sau n&oacute; l&agrave; một ngữ giới từ.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The beaker (<span style="text-decoration: line-through;">that is</span>)&nbsp;<span style="text-decoration: underline;">on the counter</span>&nbsp;contains a solution.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Trước một cấu tr&uacute;c động từ ở thể tiếp diễn.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The girl (<span style="text-decoration: line-through;">who is</span>)&nbsp;<span style="text-decoration: underline;">running down the street</span>&nbsp;might be in trouble.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Ngo&agrave;i ra trong một số trường hợp khi đại từ quan hệ trong mệnh đề phụ bắt buộc gắn liền với chủ ngữ đứng trước n&oacute; v&agrave; mệnh đề phụ ấy diễn đạt qui luật của sự kiện, người ta c&oacute; thể bỏ đại từ quan hệ v&agrave; động từ ch&iacute;nh để thay v&agrave;o đ&oacute; bằng một Verb-ing.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The travelers&nbsp;<em>taking</em>&nbsp;(<span style="text-decoration: line-through;">who take</span>) this bus on a daily basis buy their ticket in booking.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Trong những mệnh đề phụ kh&ocirc;ng bắt buộc người ta cũng c&oacute; thể loại bỏ đại từ quan hệ v&agrave; động từ&nbsp;<em>to be</em>&nbsp;khi n&oacute; đứng trước một ngữ danh từ. Tuy nhi&ecirc;n phần ngữ danh từ c&ograve;n lại vẫn phải đứng giữa 2 dấu phẩy.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Mr Jackson, (<span style="text-decoration: line-through;">who is)</span>&nbsp;a professor, is traveling in the Mideast this year.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Một trường hợp kh&aacute;c rất phổ biến l&agrave; loại bỏ đại từ quan hệ v&agrave; động từ ch&iacute;nh, thay v&agrave;o đ&oacute; bằng một Verb-ing khi mệnh đề phụ n&agrave;y bổ nghĩa cho một t&acirc;n ngữ.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; The president made a speech for the famous man&nbsp;<em>visiting</em>&nbsp;(<span style="text-decoration: line-through;">who visited</span>) him.</p>
    </li>
</ul>

</body>
</html>