<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="35">35</a>. Một số c&aacute;c động từ đặc biệt kh&aacute;c</span></h2>
<p style="margin-top: 12px;">Đ&oacute; l&agrave; những động từ ở trong c&aacute;c mẫu c&acirc;u kh&aacute;c nhau sẽ c&oacute; &yacute; nghĩa kh&aacute;c nhau.</p>
<ul>
    <li>
    <p style="margin-top: 12px;">agree to do smt: đồng &yacute; l&agrave;m g&igrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He agreed to leave early tomorrow morning.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">agree to one's doing smt: đồng &yacute; với việc ai l&agrave;m g&igrave;.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He agreed to my leaving early tomorrow morning.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Mean to do smt: định l&agrave;m g&igrave;.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I mean to get to the top of the hill before sunrise.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">If it + mean + verb-ing: cho d&ugrave; cả việc, bao h&agrave;m cả việc.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; My neighbour was determined to get a ticket for Saturday's game if it meant standing in line all night.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Propose to do smt: c&oacute; &yacute; định l&agrave;m g&igrave;.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I propose to start tomorrow.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Propose doing smt: Đề nghị l&agrave;m g&igrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I propose waiting till the police came.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Go on doing smt/smt: tiếp tục l&agrave;m g&igrave;, c&aacute;i g&igrave; (một việc đang bị bỏ dở)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He went on writing after a break</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Go on to do smt: Quay sang tiếp tục l&agrave;m g&igrave; (vẫn về c&ugrave;ng một vấn đề nhưng chuyển sang kh&iacute;a cạnh kh&aacute;c)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He showed the island on the map then went on to tell about its climate.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Try to do smt: cố gắng l&agrave;m g&igrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; He try to solve this math problem.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Try doing smt: Thử l&agrave;m g&igrave;<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I try sending her flowers, writing her letter, giving her presents, but she still wouldn&rsquo;t speak to me.</p>
    </li>
</ul>

</body>
</html>