<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2><span style="color: #0070c0;"><a name="39">39</a>. Đi trước đại từ phải c&oacute; một danh từ tương ứng với n&oacute;</span></h2>
<p>Trong một c&acirc;u tiếng Anh c&oacute; 2 mệnh đề, nếu mệnh đề thứ hai c&oacute; d&ugrave;ng đến đại từ nh&acirc;n xưng th&igrave; ở mệnh đề đầu phải c&oacute; một danh từ để đại từ đ&oacute; đại diện. Danh từ đi trước, giới thiệu đại từ phải tương đương với đại từ đ&oacute; về giống v&agrave; số.</p>
<p><strong>Incorrect</strong>:&nbsp;<br />
&nbsp;&nbsp;&nbsp; Henry was denied admission to graduate school because&nbsp;<span style="text-decoration: underline;">they</span>&nbsp;did not believe that he could handle the work load.<br />
(Đại từ they kh&ocirc;ng c&oacute; danh từ n&agrave;o đi trước n&oacute; để n&oacute; l&agrave;m đại diện. "<em>graduate school</em>" l&agrave; một đơn vị số &iacute;t n&ecirc;n kh&ocirc;ng thể được đại diện bởi&nbsp;<em>they</em>.)<br />
<br />
<strong>Correct</strong>:&nbsp;<br />
1. The&nbsp;<span style="text-decoration: underline;">members</span>&nbsp;of the admissions committee denied Henry admission to graduate school because&nbsp;<span style="text-decoration: underline;">they</span>&nbsp;did not believe that he could handle the work load.<br />
<br />
2. Henry was denied admission to graduate school because the members of the admissions committee did not believe that he could handle the work load.</p>
<p><strong>Incorrect:</strong><br />
&nbsp;&nbsp;&nbsp; George dislikes politics because he believes that&nbsp;<span style="text-decoration: underline;">they</span>&nbsp;are corrupt.&nbsp;<br />
&nbsp;&nbsp;&nbsp; George kh&ocirc;ng th&iacute;ch ch&iacute;nh trị bởi v&igrave; anh cho rằng họ tham nhũng. Đại từ&nbsp;<em>they</em>&nbsp;cũng kh&ocirc;ng c&oacute; danh từ tương ứng đi trước.&nbsp;<em>Politics</em>&nbsp;l&agrave; một danh từ số &iacute;t n&ecirc;n kh&ocirc;ng thể được đại diện bởi&nbsp;<em>they</em><br />
<br />
<strong>Correct:</strong><br />
1. George dislikes&nbsp;<span style="text-decoration: underline;">politicians</span>&nbsp;because he believes that&nbsp;<span style="text-decoration: underline;">they</span>&nbsp;are corrupt. (c&aacute;c ch&iacute;nh kh&aacute;ch)<br />
2. George dislikes politics because he believes that&nbsp;<span style="text-decoration: underline;">politicians</span>&nbsp;are corrupt.&nbsp;</p>
<p>Ngược lại với việc thiếu danh từ đi trước đại từ, nếu c&oacute; qu&aacute; nhiều (từ hai trở l&ecirc;n) danh từ c&ugrave;ng tương ứng với một đại từ th&igrave; cũng sẽ g&acirc;y nhầm lẫn. Xem v&iacute; dụ sau:</p>
<p><strong>Incorrect 1:&nbsp;</strong><br />
&nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Mr. Brown</span>&nbsp;told&nbsp;<span style="text-decoration: underline;">Mr. Adams</span>&nbsp;that&nbsp;<span style="text-decoration: underline;">he</span>&nbsp;would have to work all night in order to finish the report.<br />
&nbsp;&nbsp;&nbsp; (Kh&ocirc;ng r&otilde; đại từ&nbsp;<em>he</em>&nbsp;đại diện cho Mr. Brown hay Mr. Adams)<br />
<br />
<strong>Correct 1:&nbsp;</strong><br />
1.&nbsp;&nbsp;&nbsp;&nbsp; According to Mr. Brown, Mr. Adams will have to work all night in order to finish the report.<br />
2.&nbsp;&nbsp;&nbsp;&nbsp; Mr. Brown said that, in order to finish the report, Mr. Adams would have to work all night.&nbsp;</p>
<p><strong>Incorrect 2:&nbsp;</strong><br />
&nbsp;&nbsp;&nbsp; Janet visited her friend every day while&nbsp;<span style="text-decoration: underline;">she</span>&nbsp;was on vacation.<br />
&nbsp;&nbsp;&nbsp; (Kh&ocirc;ng r&otilde; đại từ&nbsp;<em>she</em>&nbsp;đại diện cho Janet hay&nbsp;<em>her friend</em>)<br />
<br />
<strong>Correct 2:&nbsp;</strong><br />
&nbsp;&nbsp;&nbsp; While Janet was on vacation, she visited her friend every day.<br />
<br />
<br />
</p>

</body>
</html>