<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2><span style="color: #0070c0;"><a name="40">40</a>. Sử dụng V-ing, to + verb để mở đầu một c&acirc;u</span></h2>
<h3><span style="color: #0070c0;"><a name="40.1">40.1</a>&nbsp;Sử dụng Verb-ing</span></h3>
<p>Một V-ing c&oacute; thể được d&ugrave;ng để nối hai c&acirc;u c&oacute; c&ugrave;ng chủ ngữ trở th&agrave;nh một c&acirc;u bằng c&aacute;ch biến động từ của c&acirc;u thứ nhất th&agrave;nh dạng V-ing, bỏ chủ ngữ v&agrave; nối với c&acirc;u thứ hai bằng dấu phảy. V&iacute; dụ:</p>
<p>&nbsp;&nbsp;&nbsp; The man jumped out of the boat. He was bitten by a shark.<br />
&nbsp;&nbsp;&nbsp; =&gt;&nbsp;<span style="text-decoration: underline;">After jumping</span>&nbsp;out of the boat,&nbsp;<span style="text-decoration: underline;">the man</span>&nbsp;was bitten by a shark.</p>
<p>Khi sử dụng loại c&acirc;u n&agrave;y cần hết sức lưu &yacute; rằng chủ ngữ của mệnh đề ch&iacute;nh bắt buộc phải l&agrave; chủ ngữ hợp l&yacute; của mệnh đề phụ. Khi hai mệnh đề kh&ocirc;ng c&oacute; c&ugrave;ng chủ ngữ, người ta gọi đ&oacute; l&agrave; trường hợp&nbsp;<em>chủ ngữ ph&acirc;n từ bất hợp lệ</em>.&nbsp;</p>
<p>SAI:&nbsp;&nbsp;&nbsp;&nbsp; After jumping out of the boat,&nbsp;<span style="text-decoration: underline;">the shark</span>&nbsp;bit the man.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (Ch&uacute;ng ta ngầm hiểu l&agrave; chủ ngữ thật sử của h&agrave;nh động nhảy khỏi thuyền l&agrave;&nbsp;<em>the man</em>&nbsp;chứ kh&ocirc;ng phải<em>the shark</em>)</p>
<p>Để đảm bảo kh&ocirc;ng nhầm lẫn, ngay sau mệnh đề verb-ing ta n&ecirc;n đề cập ngay đến danh từ l&agrave;m chủ ngữ cho cả hai mệnh đề.</p>
<p>Th&ocirc;ng thường c&oacute; 6 giới từ đứng trước một V-ing mở đầu cho mệnh đề phụ, đ&oacute; l&agrave;:&nbsp;<em>By</em>&nbsp;(bằng c&aacute;ch, bởi),<em>upon, after</em>&nbsp;(sau khi),&nbsp;<em>before</em>&nbsp;(trước khi),&nbsp;<em>while</em>&nbsp;(trong khi),&nbsp;<em>when</em>&nbsp;(khi).</p>
<blockquote>
<p><span style="text-decoration: underline;">By working</span>&nbsp;a ten-hour day for four days, we can have a long weekend.<br />
<span style="text-decoration: underline;">After preparing</span>&nbsp;the dinner, Pat will read a book.<br />
<span style="text-decoration: underline;">While reviewing</span>&nbsp;for the test, Mary realized that she had forgotten to study the use of participial phrases.</p>
</blockquote>
<p>Lưu &yacute; rằng:&nbsp;<em>on</em>&nbsp;+ động từ trạng th&aacute;i hoặc&nbsp;<em>in</em>&nbsp;+ động từ h&agrave;nh động th&igrave; c&oacute; thể tương đương với&nbsp;<em>when</em>&nbsp;hoặc<em>while</em>:</p>
<blockquote>
<p><span style="text-decoration: underline;">On finding</span>&nbsp;the door ajar, I aroused suspicion. (= when finding)&nbsp;<br />
(Khi thấy cửa h&eacute; mở, t&ocirc;i nảy sinh mối nghi ngờ)<br />
<span style="text-decoration: underline;">In searching</span>&nbsp;for underground deposits of oil, geologist often rely on magnometers. (= while searching)&nbsp;<br />
(Trong khi t&igrave;m c&aacute;c mỏ dầu trong l&ograve;ng đất, c&aacute;c nh&agrave; địa chất thường dựa v&agrave;o từ kế.)</p>
</blockquote>
<p>Nếu kh&ocirc;ng c&oacute; giới từ đi trước, chỉ c&oacute; V-ing xuất hiện trong mệnh đề phụ th&igrave; thời của c&acirc;u do thời của động từ ở mệnh đề ch&iacute;nh quyết định; 2 h&agrave;nh động trong hai mệnh đề thường xảy ra song song c&ugrave;ng l&uacute;c:</p>
<p><strong>Present:&nbsp;</strong></p>
<blockquote>
<p><span style="text-decoration: underline;">Practicing</span>&nbsp;her swing every day,&nbsp;<span style="text-decoration: underline;">Trica hopes</span>&nbsp;to get a job as a golf instructor.</p>
</blockquote>
<p><strong>Past:</strong></p>
<blockquote>
<p><span style="text-decoration: underline;">Having</span>&nbsp;a terrible toothache, Henry called the dentist for an appointment.</p>
</blockquote>
<p><strong>Future:</strong></p>
<blockquote>
<p><span style="text-decoration: underline;">Finishing</span>&nbsp;the letter later tonight, Sally will mail it tomorrow morning.</p>
</blockquote>
<p>Dạng thức ho&agrave;n th&agrave;nh [having + P2] được d&ugrave;ng để diễn đạt trường hợp động từ của mệnh đề phụ xảy ra trước h&agrave;nh động của mệnh đề ch&iacute;nh:</p>
<blockquote>
<p><span style="text-decoration: underline;">Having finished</span>&nbsp;their supper,&nbsp;<span style="text-decoration: underline;">the boys</span>&nbsp;went out to play.<br />
(After the boys had finished their supper...)<br />
<span style="text-decoration: underline;">Having written</span>&nbsp;his composition,&nbsp;<span style="text-decoration: underline;">Louie</span>&nbsp;handed it to his teacher.<br />
(After Louie had written ...)<br />
<span style="text-decoration: underline;">Not having read</span>&nbsp;the book,&nbsp;<span style="text-decoration: underline;">she</span>&nbsp;could not answer the question.<br />
(Because she had not read...)</p>
</blockquote>
<p>Dạng thức bị động [having been + P2] cũng thường được sử dụng để mở đầu một mệnh đề phụ:</p>
<blockquote>
<p><span style="text-decoration: underline;">Having been notified</span>&nbsp;by the court,&nbsp;<span style="text-decoration: underline;">Mary</span>&nbsp;reported for jury duty.<br />
(After Mary had been notified ...)<br />
<span style="text-decoration: underline;">Having been delayed</span>&nbsp;by the snowstorm,&nbsp;<span style="text-decoration: underline;">Jame and I</span>&nbsp;missed our connecting flight.<br />
(After we had been delayed ...)<br />
<span style="text-decoration: underline;">Not having been notified</span>&nbsp;of the change in the meeting time,&nbsp;<span style="text-decoration: underline;">George</span>&nbsp;arrived late.<br />
(Because he had not been notified ...)</p>
</blockquote>
<p>Trong nhiều trường hợp, cụm từ&nbsp;<em>being</em>&nbsp;hoặc&nbsp;<em>having been</em>&nbsp;của thể bị động c&oacute; thể được lược bỏ, khi đ&oacute; chủ ngữ của mệnh đề ch&iacute;nh vẫn phải ph&ugrave; hợp với chủ ngữ của mệnh đề phụ:</p>
<p><strong>Incorrect</strong>:&nbsp;<span style="text-decoration: underline;">Found</span>&nbsp;in Tanzania by Mary Leaky,&nbsp;<span style="text-decoration: underline;">some archeologists</span>&nbsp;estimated that the three - million - year - old fossils were the oldest human remains that were discovered. (<span style="text-decoration: line-through;">Being</span>&nbsp;found ...)<br />
<br />
<strong>Correct</strong>:&nbsp;<span style="text-decoration: underline;">Found</span>&nbsp;in Tanzania by Mary Leaky,&nbsp;<span style="text-decoration: underline;">the three-million-year-old fossils</span>&nbsp;were estimated by some archeologists to be the oldest human remains that had ever been discovered.</p>
<p>X&eacute;t th&ecirc;m c&aacute;c v&iacute; dụ sau về&nbsp;<em>chủ ngữ ph&acirc;n từ bất hợp lệ</em>:</p>
<p>SAI:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Having apprehended the hijackers, they were whisked off to FBI headquarters by the security guards.<br />
Đ&Uacute;NG:&nbsp;<span style="text-decoration: underline;">Having apprehended</span>&nbsp;the hijackers,&nbsp;<span style="text-decoration: underline;">the security guards</span>&nbsp;whisked them off to FBI headquarters.<br />
Đ&Uacute;NG:&nbsp;<span style="text-decoration: underline;">Having been apprehended</span>, the hijackers were whisked off to FBI headquarters by the security guards.<br />
<br />
SAI:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Before singing the school song, a poem was recited.<br />
Đ&Uacute;NG:&nbsp;<span style="text-decoration: underline;">Before singing</span>&nbsp;the school song,&nbsp;<span style="text-decoration: underline;">the students</span>&nbsp;recited a poem.<br />
<br />
SAI:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Guiding us through the museum, a special explanation was given by the director.<br />
Đ&Uacute;NG:&nbsp;<span style="text-decoration: underline;">Guiding</span>&nbsp;us through the museum,&nbsp;<span style="text-decoration: underline;">the director</span>&nbsp;gave us a special explanation.&nbsp;</p>
<h3><span style="color: #0070c0;"><a name="40.2">40.2</a>&nbsp;Động từ nguy&ecirc;n thể (to + verb) mở đầu c&acirc;u</span></h3>
<p>Động từ nguy&ecirc;n thể cũng được d&ugrave;ng để mở đầu một c&acirc;u giống như trong trường hợp V-ing. Mệnh đề phụ đứng đầu c&acirc;u sử dụng động từ nguy&ecirc;n thể thường diễn tả mục đ&iacute;ch của mệnh đề ch&iacute;nh.</p>
<blockquote>
<p><span style="text-decoration: underline;">To get up</span>&nbsp;early,&nbsp;<span style="text-decoration: underline;">Jim</span>&nbsp;never stay up late.</p>
</blockquote>
<p>Cũng giống như trường hợp sử dụng V-ing n&ecirc;u tr&ecirc;n, chủ ngữ của mệnh đề thứ hai cũng phải l&agrave; chủ ngữ hợp l&yacute; của mệnh đề phụ đứng trước n&oacute;.</p>
<blockquote>
<p><strong>Incorrect</strong>:&nbsp;<span style="text-decoration: underline;">To prevent cavities</span>,&nbsp;<span style="text-decoration: underline;">dental floss</span>&nbsp;should be used daily after brushing one's teeth.<br />
<strong>Correct:&nbsp;&nbsp;</strong>&nbsp;<span style="text-decoration: underline;">To prevent cavities</span>,&nbsp;<span style="text-decoration: underline;">one</span>&nbsp;should use dental floss daily after brushing one&rsquo;s teeth.<br />
<br />
<br />
</p>
</blockquote>

</body>
</html>