<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2><span style="color: #0070c0;"><a name="41">41</a>. Động từ (V-ing, V-ed) d&ugrave;ng l&agrave;m t&iacute;nh từ</span></h2>
<p>Th&ocirc;ng thường, khi một động từ kh&ocirc;ng c&oacute; dạng thức t&iacute;nh từ tương ứng với n&oacute; th&igrave; ph&acirc;n từ 1 (V-ing) hoặc ph&acirc;n từ 2 (P2) của động từ đ&oacute; được sử dụng l&agrave;m t&iacute;nh từ. Đ&ocirc;i khi người học tiếng Anh kh&ocirc;ng biết n&ecirc;n d&ugrave;ng t&iacute;nh từ ở dạng thức n&agrave;o:&nbsp;<em>V-ing</em>&nbsp;hay&nbsp;<em>Verb-ed</em>&nbsp;hay&nbsp;<em>Verb-en</em>.&nbsp;</p>
<ul>
    <li>T&iacute;nh từ dạng V-ing thường được d&ugrave;ng khi danh từ m&agrave; n&oacute; bổ nghĩa&nbsp;<em>thực hiện hoặc chịu tr&aacute;ch nhiệm</em>về h&agrave;nh động. Động từ thường l&agrave; nội động từ (kh&ocirc;ng c&oacute; t&acirc;n ngữ) v&agrave; thời của động từ l&agrave; thời tiếp diễn:<br />
    &nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">crying baby</span>&nbsp;woke Mr.Binion. (The baby&nbsp;<span style="text-decoration: underline;">was crying</span>)<br />
    &nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">blooming flowers</span>&nbsp;in the meadow created a rainbow of colors. (The flowers&nbsp;<span style="text-decoration: underline;">were blooming</span>)<br />
    &nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">purring kitten</span>&nbsp;snuggled close to the fireplace. (The kitten&nbsp;<span style="text-decoration: underline;">was purring</span>)</li>
    <li>
    <p style="margin-top: 12px;">Ph&acirc;n từ 2 (V-ed) được d&ugrave;ng l&agrave;m t&iacute;nh từ khi danh từ m&agrave; n&oacute; bổ nghĩa l&agrave; đối tượng nhận sự t&aacute;c động của h&agrave;nh động. C&acirc;u c&oacute; t&iacute;nh từ ở dạng P2 thường c&oacute; nguồn gốc từ những c&acirc;u bị động.<br />
    &nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">sorted mail</span>&nbsp;was delivered to the offices before noon. (The mail&nbsp;<span style="text-decoration: underline;">had been sorted</span>).<br />
    &nbsp;&nbsp;&nbsp;&nbsp;<span style="text-decoration: underline;">Frozen food</span>&nbsp;is often easier to prepare than fresh food. (The food&nbsp;<span style="text-decoration: underline;">had been frozen</span>)<br />
    &nbsp;&nbsp;&nbsp; The&nbsp;<span style="text-decoration: underline;">imprisoned men</span>&nbsp;were unhappy with their living conditions. (The men&nbsp;<span style="text-decoration: underline;">had been imprisoned</span>)</p>
    </li>
</ul>
<p><strong>Lưu &yacute;</strong>: Một số c&aacute;c động từ như&nbsp;<em>to interest, to bore, to excite, to frighten</em>&nbsp;khi sử dụng l&agrave;m t&iacute;nh từ thường kh&oacute; x&aacute;c định n&ecirc;n d&ugrave;ng loại n&agrave;o (ph&acirc;n từ 1 hay ph&acirc;n từ 2). Nguy&ecirc;n tắc &aacute;p dụng cũng giống như đ&atilde; n&ecirc;u tr&ecirc;n: Nếu chủ ngữ g&acirc;y ra h&agrave;nh động th&igrave; d&ugrave;ng P1, nếu chủ ngữ nhận t&aacute;c động của h&agrave;nh động th&igrave; d&ugrave;ng P2. X&eacute;t th&ecirc;m c&aacute;c v&iacute; dụ sau:</p>
<blockquote>
<p>The&nbsp;<span style="text-decoration: underline;">boring professor</span>&nbsp;put the students to sleep.<br />
The&nbsp;<span style="text-decoration: underline;">boring lecture</span>&nbsp;put the students to sleep.<br />
The&nbsp;<span style="text-decoration: underline;">bored students</span>&nbsp;went to sleep during the&nbsp;<span style="text-decoration: underline;">boring lecture</span>.<br />
The child saw a&nbsp;<span style="text-decoration: underline;">frightening movie</span>.<br />
The&nbsp;<span style="text-decoration: underline;">frightened child</span>&nbsp;began to cry.<br />
<br />
<br />
</p>
</blockquote>


</body>
</html>