<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2><span style="color: #0070c0;"><a name="46">46</a>. Khi ph&oacute; từ đứng đầu c&acirc;u để nhấn mạnh, phải đảo cấu tr&uacute;c c&acirc;u</span></h2>
<p>Trong một số trường hợp c&aacute;c ph&oacute; từ kh&ocirc;ng đứng ở vị tr&iacute; b&igrave;nh thường của n&oacute; m&agrave; đảo l&ecirc;n đứng ở đầu c&acirc;u nhằm nhấn mạnh v&agrave;o h&agrave;nh động của chủ ngữ. Trong trường hợp đ&oacute; ngữ ph&aacute;p sẽ thay đổi, đằng sau ph&oacute; từ đứng đầu c&acirc;u l&agrave; trợ động từ rồi mới đến chủ ngữ v&agrave; động từ ch&iacute;nh:</p>
<blockquote>
<p>John&nbsp;<span style="text-decoration: underline;">hardly</span>&nbsp;<span style="text-decoration: underline;">remembers</span>&nbsp;the accident that took his sister's life.<br />
<span style="text-decoration: underline;">Hardly</span>&nbsp;<span style="text-decoration: underline;">does</span>&nbsp;John&nbsp;<span style="text-decoration: underline;">remember</span>&nbsp;the accident that took his sister's life.&nbsp;</p>
</blockquote>
<p style="text-align: center;"><strong><span style="color: #c00000;">{hardly, rarely, seldom, never, only ...} + auxiliary + subject + verb ...</span></strong></p>
<blockquote>
<p>Never have so many people been unemployed as today.<br />
&nbsp;&nbsp;&nbsp; (So many people have never been unemployed as today)<br />
Hardly had he fallen asleep when he began to dream of far-way lands.<br />
&nbsp;&nbsp;&nbsp; (He had hardly fallen asleep when he began to dream of far-way lands.)<br />
Rarely have we seen such an effective actor as he has proven himself to be.<br />
&nbsp;&nbsp;&nbsp; (We have rarely seen such an effective actor as he has proven himself to be.)<br />
Seldom does class let out early.<br />
&nbsp;&nbsp;&nbsp; (Class seldom lets out early.)<br />
Only by hard work will we be able to accomplish this great task.<br />
&nbsp;&nbsp;&nbsp; (We will be able to accomplish this great task only by hard work.)</p>
</blockquote>
<p><strong>Một số c&aacute;c trạng từ đặc biệt kh&aacute;c cũng thường đứng ở đầu c&acirc;u, phải đảo cấu tr&uacute;c c&acirc;u như tr&ecirc;n:</strong></p>
<ul>
    <li>
    <p style="margin-top: 12px;">In/ Under no circumstances: D&ugrave; trong bất cứ ho&agrave;n cảnh n&agrave;o cũng kh&ocirc;ng.<br />
    &nbsp;&nbsp;&nbsp; Under no circumstances should you lend him the money.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">On no account: D&ugrave; bất cứ l&yacute; do g&igrave; cũng kh&ocirc;ng<br />
    &nbsp;&nbsp;&nbsp; On no accout must this switch be touched.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Only in this way: Chỉ bằng c&aacute;ch n&agrave;y<br />
    &nbsp;&nbsp;&nbsp; Only in this way could the problem be solved</p>
    </li>
    <li>
    <p style="margin-top: 12px;">In no way: Kh&ocirc;ng sao c&oacute; thể&nbsp;<br />
    &nbsp;&nbsp;&nbsp; In no way could I agree with you.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">By no means: Ho&agrave;n to&agrave;n kh&ocirc;ng<br />
    &nbsp;&nbsp;&nbsp; By no means does he intend to criticize your idea.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Negative ..., nor + auxiliary + S + V<br />
    &nbsp;&nbsp;&nbsp; He had no money, nor did he know anybody from whom he could borrow.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Khi một mệnh đề mở đầu bằng c&aacute;c th&agrave;nh ngữ chỉ nơi chốn hoặc trật tự th&igrave; động từ ch&iacute;nh c&oacute; thể đảo l&ecirc;n chủ ngữ nhưng tuyệt đối kh&ocirc;ng được sử dụng trợ động từ trong trường hợp n&agrave;y.<br />
    Clause of place/ order + main verb + S (no auxiliary)<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In front of the museum is a statue.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; First came the ambulance, then came the police.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ( Thoạt đầu l&agrave; xe cứu thương chạy đến, tiếp sau l&agrave; cảnh s&aacute;t.)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Khi một ngữ giới từ l&agrave;m ph&oacute; từ chỉ địa điểm hoặc phương hướng đứng ở đầu c&acirc;u, c&aacute;c nội động từ đặt l&ecirc;n trước chủ ngữ nhưng tuyệt đối kh&ocirc;ng được sử dụng trợ động từ trong loại c&acirc;u n&agrave;y. N&oacute; rất phổ biến trong văn m&ocirc; tả khi muốn diễn đạt một chủ ngữ kh&ocirc;ng x&aacute;c định:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Under the tree was lying one of the biggest men I had ever seen.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Directly in front of them stood a great castle.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On the grass sat an enormous frog.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Along the road came a strange procession.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">T&iacute;nh từ cũng c&oacute; thể đảo l&ecirc;n tr&ecirc;n đầu c&acirc;u để nhấn mạnh v&agrave; sau đ&oacute; l&agrave; li&ecirc;n từ nhưng tuyệt đối kh&ocirc;ng được sử dụng trợ động từ.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; So determined was she to take the university course that she taught school and gave music lesson for her tuition fees.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Trong một số trường hợp người ta cũng c&oacute; thể đảo to&agrave;n bộ động từ ch&iacute;nh l&ecirc;n tr&ecirc;n chủ ngữ để nhấn mạnh, những động từ được đảo l&ecirc;n tr&ecirc;n trong trường hợp n&agrave;y phần lớn đều mang sắc th&aacute;i bị động nhưng ho&agrave;n to&agrave;n kh&ocirc;ng c&oacute; nghĩa bị động.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lost, however, are the secrets of the Mayan astronomers and the Inca builders as well as many medicinal practices.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (Mất đi vĩnh viễn, tuy vậy, lại l&agrave; những b&iacute; mật của những nh&agrave; thi&ecirc;n văn thuộc nền văn minh Mayan, ...)</p>
    </li>
    <li>
    <p style="margin-top: 12px;">C&aacute;c ph&oacute; từ away ( = off ), down, in, off, out, over, round, up... c&oacute; thể theo sau l&agrave; một động từ chuyển động v&agrave; sau đ&oacute; l&agrave; một danh từ l&agrave;m chủ ngữ:<br />
    + Away/down/in/off/out/over/round/up...+ motion verb + noun/noun phrase as a subject.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Away went the runners/ Down fell a dozen of apples...<br />
    + Nhưng nếu một đại từ nh&acirc;n xưng l&agrave;m chủ ngữ th&igrave; động từ phải để sau chủ ngữ:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Away they went/ Round and round it flew.<br />
    + Trong tiếng Anh viết (written English) c&aacute;c ngữ giới từ mở đầu bằng c&aacute;c giới từ down, from, in, on, over, out of, round, up... c&oacute; thể được theo sau ngay bởi động từ chỉ vị tr&iacute; (crouch, hang, lie, sit, stand...) hoặc c&aacute;c dạng động từ chỉ chuyển động, c&aacute;c động từ như be born/ die/ live v&agrave; một số dạng động từ kh&aacute;c.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; From the rafters hung strings of onions.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; In the doorway stood a man with a gun.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; On a perch beside him sat a blue parrot.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Over the wall came a shower of stones.<br />
    <br />
    *Lưu &yacute;: 3 v&iacute; dụ đầu của c&aacute;c v&iacute; dụ tr&ecirc;n c&oacute; thể diễn đạt bằng một VERB-ING mở đầu cho c&acirc;u v&agrave; động từ BE đảo l&ecirc;n tr&ecirc;n chủ ngữ:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Hanging from the rafters were strings of onion.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Standing in the doorway was a man with a gun.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Sitting on a perch beside him was a blue parrot.<br />
    Hiện tượng n&agrave;y c&ograve;n xảy ra khi chủ ngữ sau c&aacute;c ph&oacute; từ so s&aacute;nh as/than qu&aacute; d&agrave;i:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; She was very religious, as were most of her friends.<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; City dwellers have a higher death rate than do country people.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">T&acirc;n ngữ mang t&iacute;nh nhấn mạnh cũng c&oacute; thể đảo l&ecirc;n đầu c&acirc;u:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Not a single word did he say.</p>
    </li>
    <li>
    <p style="margin-top: 12px;">Here/There hoặc một số c&aacute;c ph&oacute; từ đi kết hợp với động từ đứng đầu c&acirc;u cũng phải đảo động từ l&ecirc;n tr&ecirc;n chủ ngữ l&agrave; một danh từ, nhưng nếu chủ ngữ l&agrave; một đại từ th&igrave; kh&ocirc;ng được đảo động từ:<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Here comes Freddy.<br />
    <em>Incorrect</em>: Here comes he<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Off we go<br />
    <em>Incorrect</em>: Off go we<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; There goes your brother<br />
    &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I stopped the car, and up walked a policeman.</p>
    </li>
</ul>
<h1 style="margin-top: 12px; text-align: left;"></h1>


</body>
</html>