<!DOCTYPE html>
<html>
	<head>
		<meta charset="UTF-8">
		<title>Ngữ Pháp Tiếng Anh</title>
		<meta name="viewport" content="width=device-width, initial-scale=1"> 		
	</head>
<body>
<h2 style="margin-top: 12px;"><span style="color: #0070c0;"><a name="49">49</a>. C&aacute;ch l&agrave;m b&agrave;i trắc nghiệm ngữ ph&aacute;p</span></h2>
<p style="margin-top: 12px;">Thường th&igrave; trong b&agrave;i thi trắc nghiệm ngữ ph&aacute;p, bạn sẽ kh&ocirc;ng thể trả lời ngay bằng c&aacute;ch chỉ &aacute;p dụng một quy tắc ngữ ph&aacute;p nhất định n&agrave;o đ&oacute; m&agrave; phải kết hợp hai hay nhiều quy tắc kh&aacute;c nhau để loại trừ phương &aacute;n sai. &Aacute;p dụng lần lượt c&aacute;c bước sau:</p>
<p style="margin-top: 12px;">(1) Kiểm tra c&aacute;c lỗi ngữ ph&aacute;p cơ bản bao gồm<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (a) Sự ho&agrave; hợp giữa chủ ngữ v&agrave; vị ngữ<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (b) C&aacute;ch sử dụng Adj v&agrave; Adv<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (c) Vị tr&iacute; v&agrave; thứ tự của c&aacute;c Adv.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (d) Sự ph&ugrave; hợp giữa c&aacute;c thời động từ.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (e) Đại từ c&oacute; danh từ duy nhất để n&oacute; đại diện hay kh&ocirc;ng.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (f) Cấu tr&uacute;c c&acirc;u song song.<br />
<br />
(2) Loại bỏ những c&acirc;u trả lời rườm r&agrave;, c&acirc;u c&agrave;ng ngắn gọn v&agrave; dễ hiểu c&agrave;ng tốt:<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (a) Tr&aacute;nh c&aacute;c đ&aacute;p &aacute;n d&agrave;i d&ograve;ng như:<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; John read the letter&nbsp;<span style="text-decoration: underline;">in a thoughtful maner</span>. (can be replaced by&nbsp;<em>thoughtfully</em>)<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (b) Tr&aacute;nh c&aacute;c đ&aacute;p &aacute;n c&oacute; 2 từ nghĩa giống nhau.<br />
<br />
(3) Loại bỏ những đ&aacute;p &aacute;n c&oacute; từ vựng kh&ocirc;ng r&otilde; nghĩa:<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (a) Phải chắc chắn rằng tất cả c&aacute;c từ đều c&oacute; nghĩa trong c&acirc;u.<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (b) Phải đảm bảo những động từ c&oacute; 2 từ phải được nối với nhau bằng một giới từ ph&ugrave; hợp (xem phần sau)<br />
<br />
(4) Tr&aacute;nh d&ugrave;ng c&aacute;c từ l&oacute;ng, tiếng l&oacute;ng. Từ l&oacute;ng chỉ d&ugrave;ng trong văn n&oacute;i, kh&ocirc;ng d&ugrave;ng trong văn viết. V&iacute; dụ<br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>really</em>&nbsp;khi d&ugrave;ng với nghĩa&nbsp;<em>very</em><br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<em>bunch</em>&nbsp;khi d&ugrave;ng với nghĩa&nbsp;<em>many</em><br />
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; any noun +&nbsp;<em>wise</em>&nbsp;khi d&ugrave;ng với nghĩa&nbsp;<em>in relation to</em>&nbsp;...<br />
<br />
<strong>V&iacute; dụ:</strong></p>
<p style="margin-top: 12px;">1. Before we can decide on the future uses of this drug, ________<br />
(A) many more informations must be reviewed.<br />
(B) is necessary to review more information.<br />
(C) we must review much more information.<br />
(D) another information must to be reviewed.<br />
<br />
<em>Ph&acirc;n t&iacute;ch</em>:</p>
<blockquote>
<p style="margin-top: 12px;">(A) c&oacute; 2 chỗ sai: kh&ocirc;ng d&ugrave;ng&nbsp;<em>many</em>&nbsp;với&nbsp;<em>information</em>&nbsp;l&agrave; danh từ kh&ocirc;ng đếm được v&agrave; kh&ocirc;ng được viết l&agrave;&nbsp;<em>informations</em>.<br />
(B) c&oacute; 1 chỗ sai v&igrave; thiếu chủ ngữ.<br />
(C) đ&uacute;ng<br />
(D) c&oacute; 2 chỗ sai: kh&ocirc;ng d&ugrave;ng&nbsp;<em>another</em>&nbsp;với danh từ kh&ocirc;ng đếm được v&agrave; sau trợ động từ must l&agrave; động từ nguy&ecirc;n thể kh&ocirc;ng c&oacute;&nbsp;<em>to</em>.</p>
</blockquote>
<p style="margin-top: 12px;">2. In this country, a growing concern about the possible hazardous effects ofchemical wastes ________<br />
(A) have resulted in a bunch of new laws.<br />
(B) has resulted in several new laws.<br />
(C) is causing the results of numerous new laws.<br />
(D) result in news laws.</p>
<p style="margin-top: 12px;"><em>Ph&acirc;n t&iacute;ch</em>:</p>
<blockquote>
<p style="margin-top: 12px;">(A) c&oacute; 2 chỗ sai: kh&ocirc;ng d&ugrave;ng động từ ở số nhiều&nbsp;<em>have</em>&nbsp;với chủ ngữ số &iacute;t&nbsp;<em>a growing concern</em>&nbsp;v&agrave; kh&ocirc;ng được d&ugrave;ng từ l&oacute;ng (slang)&nbsp;<em>bunch of</em>.<br />
(B) đ&uacute;ng.<br />
(C) rườm r&agrave;.&nbsp;<em>Causing the result of</em>&nbsp;l&agrave; qu&aacute; d&agrave;i d&ograve;ng.<br />
(D) c&oacute; 2 chỗ sai: kh&ocirc;ng d&ugrave;ng&nbsp;<em>result</em>&nbsp;(động từ số nhiều) với chủ ngữ l&agrave; danh từ số &iacute;t v&agrave; kh&ocirc;ng được d&ugrave;ng dạng thức số nhiều của t&iacute;nh từ (viết đ&uacute;ng phải l&agrave;&nbsp;<em>new laws</em>).<br />
<br />
<br />
</p>
</blockquote>


</body>
</html>